{"Year":{"0":"2012","1":"2011","2":"2011","3":"2011","4":"2007","5":"2007","6":"2006","7":"2006","8":"2005","9":"2005","10":"2004","11":"2004","12":"2004","13":"2004","14":"2004","15":"2004","16":"2003","17":"2002","18":"2000","19":"2000","20":"2000","21":"1999","22":"1999","23":"1999","24":"1997","25":"1997","26":"1996","27":"1996","28":"1991"},"Milestone":{"0":"Played his last Test against Australia at Adelaide between January 24 and 28, 2012 and finished as the second highest run-getter of all time with 13,288 runs at an average of 52.31 from 164 Test matches.","1":"Played his last ODI against England on September 16, 2011, finishing as the seventh highest run-getter of all time with 10,889 runs at an average of 39.16 from 318 innings.","2":"Retired from T20Is after a solitary appearance against England on August 31, 2011, during which he scored 31 runs.","3":"Became only the third Indian to carry his bat through an innings, scoring an unbeaten 146 out of 300 during The Oval Test.","4":"Led India to a Test-series win in England (1-0) after 21 years.","5":"Completed 10,000 ODI runs during an innings of 66 against Sri Lanka at Margao.","6":"Led India to a Test-series win (1-0) in the West Indies after 35 years.","7":"Became only the second Indian player to remain on the field throughout a complete Test match (v Pakistan at Lahore in 2005-06) after Sunil Gavaskar (vs West Indies at Georgetown in 1982-83).","8":"Appointed captain of the Indian team.","9":"Has twice scored hundreds in each innings of a Test – v New Zealand at Hamilton in 1998-99 and v Pakistan at Calcutta in 2004-05. He’s only the second Indian after Sunil Gavaskar to have performed the feat of scoring twin-tons more than once.","10":"Posted his highest Test score of 270 in the Rawalpindi Test, which gave India their first ever series win in Pakistan. It is also the longest ever innings played by an Indian in Test cricket.","11":"Became the first player to score a century in all Test-playing nations when he scored 160 against Bangladesh at Chittagong.","12":"Awarded the ICC Player of the Year and the Test Player of the Year at the inaugural ICC award ceremony held in September.","13":"Became only the second batsman after Don Bradman to score double hundreds in three successive series by making 222 vs. New Zealand at Ahmedabad, 2003-04; 233 vs. Australia at Adelaide, 2003-04 and 270 vs. Pakistan at Rawalpindi, 2003-04.","14":"Batted for 173 consecutive innings in international cricket (Tests + ODIs) without a duck between 2000 and 2004 – the longest sequence for any batsman without duck.","15":"Batted for 120 consecutive innings without a duck between 1999 and 2004 – a record for any batsman in ODIs.","16":"Posted match-winning innings of 233 & 72* in the Adelaide Test to give India their first Test victory in Australia in 23 years.","17":"Became the only Indian to score four Test centuries on the trot with innings of 115, 148, 217 and 100* against England (first three) and West Indies (last) respectively.","18":"Scored his first double-ton (200*) in Tests against Zimbabwe at Delhi.","19":"Joined English county side Kent and topped the club’s averages with 1,039 runs at 49.47.","20":"Named one of the Top 5 Wisden Cricketers of the Year.","21":"Recorded the highest ever partnership in ODIs with a 331-run stand for the second wicket with Sachin Tendulkar against New Zealand. Dravid also posted his highest ODI score of 153 during this partnership. Became the only player to feature in TWO triple-century partnerships in ODIs.","22":"Featured in first-ever 300-partnership in ODIs with a 318-run stand for the second wicket with Sourav Ganguly against Sri Lanka at Taunton.","23":"Finished the ICC ODI World Cup held in England as the leading run-getter with 461 runs.","24":"Scored his first ODI century (107) against Pakistan at Chennai.","25":"Scored his first Test century (148) against South Africa at Johannesburg.","26":"Made his ODI debut against Sri Lanka at Singapore scoring just three runs in an Indian win.","27":"Made 95 on Test debut against England at Lord’s batting at No. 7.","28":"Scored 82 on first-class debut for Karnataka against Maharashtra."}}